Repository: tobagin/Draughts
Catalog: po/*.po
Languages: pt_br, ru

source: @NAME@
pt_br: Damas
ru: @ИМЯ@

source: A classic draughts game built with GTK4/LibAdwaita
pt_br: Um jogo clássico de damas criado com GTK4/LibAdwaita
ru: Классическая игра, построенная с GTK4/Libadwaita

source: draughts;draughts;board;game;strategy;
pt_br: damas;tabuleiro;jogo;estratégia;
ru: draughts;draughts;board;game;strategy;шашки;доска;игра;стратегия;

source: Play draughts (checkers) with 16 variants, AI opponents, and online multiplayer
pt_br: Jogue damas com 16 variantes, oponentes IA e multijogador online
ru: Играйте в шашки 16 вариантов, ИИ противниками и онлайн игроками

source: Draughts is a comprehensive checkers/draughts game featuring 16 international game variants, multiple AI difficulty levels, online multiplayer, and a beautiful modern interface built with GTK4 and LibAdwaita. Whether you're a casual player or a serious competitor, Draughts offers engaging gameplay for players of all skill levels - play against AI, friends locally, or opponents online!
pt_br: Damas é um jogo abrangente de damas que apresenta 16 variantes de jogo internacionais, múltiplos níveis de dificuldade de IA, multijogador online e uma bela interface moderna construída com GTK4 e LibAdwaita. Quer seja um jogador casual ou um competidor sério, Damas oferece um jogo envolvente para jogadores de todos os níveis de habilidade - jogue contra IA, amigos localmente ou oponentes online!
ru: Draughts - это комплексная игра в шашки, включающая в себя 16 международных вариантов игры, несколько уровней сложности с искусственным интеллектом, многопользовательскую онлайн-игру и красивый современный интерфейс, созданный с использованием GTK4 и LibAdwaita. Являетесь ли вы обычным игроком или серьезным соперником, Draughts предлагает увлекательный игровой процесс для игроков любого уровня квалификации - играйте против искусственного интеллекта, друзей локально или с противниками онлайн!

source: Game Features:
pt_br: Recursos do Jogo:
ru: Особенности игры:

source: 16 international draughts variants including American Checkers, International Draughts, Russian, Brazilian, and more
pt_br: 16 variantes internacionais de damas incluindo Damas Americanas, Damas Internacionais, Russas, Brasileiras e mais
ru: 16 вариантов международных шашек, включая американские шашки, международные шашки, русские, бразильские и другие

source: 10 AI difficulty levels from Beginner to Grandmaster
pt_br: 10 níveis de dificuldade de IA do Iniciante ao Grão-Mestre
ru: 10 уровней сложности искусственного интеллекта от новичка до гроссмейстера

source: Online multiplayer with quick match, room hosting, and session persistence
pt_br: Multijogador online com partida rápida, criação de salas e persistência de sessão
ru: Многопользовательская онлайн-игра с быстрой реакцией, размещением в комнате и сохранением сеанса

source: Human vs Human (local and online), Human vs AI, and AI vs AI gameplay modes
pt_br: Modos de jogo Humano vs Humano (local e online), Humano vs IA e IA vs IA
ru: Режимы игры : Человек против человека (локально и онлайн), Человек против ИИ , ИИ против ИИ

source: Complete move history with undo/redo support
pt_br: Histórico completo de movimentos com suporte para desfazer/refazer
ru: Полная история перемещений с поддержкой отмены / повтора

source: PDN (Portable Draughts Notation) export for game analysis
pt_br: Exportação PDN (Portable Draughts Notation) para análise de jogos
ru: Экспорт PDN (портативной шашечной нотации) для анализа игры

source: Multiple board themes and piece styles (plastic, wood, metal, bottle-cap)
pt_br: Múltiplos temas de tabuleiro e estilos de peças (plástico, madeira, metal, tampinha)
ru: Различные темы оформления досок и стили элементов (пластик, дерево, металл, крышки от бутылок)

source: Timer modes: countdown, Fischer increment, and Bronstein delay
pt_br: Modos de cronômetro: contagem regressiva, incremento Fischer e atraso Bronstein
ru: Режимы таймера: обратный отсчет, увеличение по Фишеру и задержка по Бронштейну

source: Accessibility and Polish:
pt_br: Acessibilidade e Refinamento:
ru: Доступность и отполированность:

source: Sound effects for moves, captures, and game events
pt_br: Efeitos sonoros para movimentos, capturas e eventos do jogo
ru: Звуковые эффекты для ходов, захватов и игровых событий

source: Keyboard navigation and screen reader support
pt_br: Navegação por teclado e suporte para leitores de tela
ru: Поддержка навигации с клавиатуры и чтения с экрана

source: High contrast mode for better visibility
pt_br: Modo de alto contraste para melhor visibilidade
ru: Режим высокой контрастности для лучшей видимости

source: Smooth animations and visual feedback
pt_br: Animações suaves e feedback visual
ru: Плавная анимация и визуальная обратная связь

source: Game history browser with replay functionality
pt_br: Navegador de histórico de jogos com funcionalidade de replay
ru: Просмотр истории игр с функцией воспроизведения

source: Comprehensive rules documentation for each variant
pt_br: Documentação completa de regras para cada variante
ru: Подробная документация по правилам для каждого варианта

source: Adaptive board orientation - your pieces always at the bottom
pt_br: Orientação adaptativa do tabuleiro - as suas peças sempre na parte inferior
ru: Адаптивная ориентация доски - ваши шашки всегда находятся внизу

source: Main game window with active gameplay
pt_br: Janela principal do jogo com jogo ativo
ru: Главное игровое окно с активным игровым процессом

source: New game setup dialog with variant selection
pt_br: Diálogo de configuração de novo jogo com seleção de variante
ru: Новое диалоговое окно настройки игры с выбором варианта

source: Active game with piece movement
pt_br: Jogo ativo com movimento de peças
ru: Активная игра с перемещением шашкек

source: Game paused overlay
pt_br: Sobreposição de jogo pausado
ru: Игра приостановлена

source: Game history browser with saved games
pt_br: Navegador de histórico de jogos com jogos guardados
ru: Обозреватель истории игр с сохранёнными играми

source: Replay previous games from history
pt_br: Reproduzir jogos anteriores do histórico
ru: Воспроизвести предыдущие игры из истории

source: Preferences with customization options
pt_br: Preferências com opções de personalização
ru: Предпочтения с возможностью настройки

source: Keyboard shortcuts reference
pt_br: Referência de atalhos de teclado
ru: Справочник по сочетаниям клавиш

source: About dialog
pt_br: Diálogo Acerca de
ru: Диалог о программе

source: checkers
pt_br: damas
ru: шашки

source: draughts
pt_br: damas
ru: шашки

source: board game
pt_br: jogo de tabuleiro
ru: настольная игра

source: strategy
pt_br: estratégia
ru: стратегия

source: AI
pt_br: IA
ru: ИИ

source: puzzle
pt_br: quebra-cabeça
ru: головоломка

source: international
pt_br: internacional
ru: международные

source: american
pt_br: americana
ru: американские

source: russian
pt_br: russa
ru: русские

source: brazilian
pt_br: brasileira
ru: бразильские

source: Major update: Online Multiplayer with extensive improvements
pt_br: Atualização importante: Multijogador online com melhorias extensivas
ru: Крупное обновление: Многопользовательская онлайн-игра с обширными улучшениями

source: NEW: Online Multiplayer Features
pt_br: NOVO: Funcionalidades de multijogador online
ru: НОВИНКА: Многопользовательские функции онлайн

source: Play draughts online against opponents worldwide
pt_br: Jogue damas online contra oponentes de todo o mundo
ru: Играть в шашки онлайн против соперников со всего мира

source: Host private game rooms with unique room codes
pt_br: Crie salas de jogo privadas com códigos de sala únicos
ru: Создать приватные игровые комнаты с уникальными кодами

source: Quick match system for instant random opponent pairing
pt_br: Sistema de partida rápida para emparelhamento instantâneo com oponentes aleatórios
ru: Система быстрого матча для мгновенного случайного подбора соперника

source: Session persistence - reconnect to games after disconnections
pt_br: Persistência de sessão - reconecte-se aos jogos após desconexões
ru: Сохранение сессии — повторное подключение к играм после разрывов соединения

source: Server crash recovery with automatic reconnection
pt_br: Recuperação de falha do servidor com reconexão automática
ru: Восстановление после сбоя сервера с автоматическим переподключением

source: Support for all 16 game variants in multiplayer
pt_br: Suporte para todas as 16 variantes de jogo em multijogador
ru: Поддержка всех 16 вариантов игры в многопользовательском режиме

source: Timer support in online games (Fischer and Bronstein modes)
pt_br: Suporte de temporizador em jogos online (modos Fischer e Bronstein)
ru: Поддержка таймера в онлайн-играх (режимы Фишера и Бронштейна)

source: Real-time game synchronization via WebSocket
pt_br: Sincronização de jogo em tempo real através de WebSocket
ru: Синхронизация игры в реальном времени через WebSocket

source: Opponent disconnect/reconnect notifications
pt_br: Notificações de desconexão/reconexão do oponente
ru: Уведомления о отключении/повторном подключении противника

source: Board and Gameplay Improvements
pt_br: Melhorias do tabuleiro e do jogo
ru: Улучшения доски и игрового процесса

source: Adaptive board orientation - your pieces always appear at the bottom
pt_br: Orientação adaptativa do tabuleiro - as suas peças aparecem sempre na parte inferior
ru: Адаптивная ориентация доски - ваши шашки всегда отображаются внизу

source: Works in single-player (color selection) and multiplayer
pt_br: Funciona em modo um jogador (seleção de cor) e multijogador
ru: Работает как в одиночной игре (выбор цвета), так и в многопользовательской

source: Proper piece highlighting based on current player in multiplayer
pt_br: Destaque adequado de peças baseado no jogador atual em multijogador
ru: Правильное выделение шашек в зависимости от текущего игрока в многопользовательском режиме

source: Fixed captured pieces synchronization in online games
pt_br: Sincronização corrigida de peças capturadas em jogos online
ru: Исправлена синхронизация захваченных шашек в онлайн-играх

source: Improved board perspective transformations
pt_br: Transformações de perspectiva do tabuleiro melhoradas
ru: Улучшенные преобразования перспективы доски

source: UI/UX Enhancements
pt_br: Melhorias de UI/UX
ru: Улучшения ПИ

source: New multiplayer dialog with modern ViewStack navigation
pt_br: Novo diálogo multijogador com navegação moderna ViewStack
ru: Новый многопользовательский диалог с современной навигацией ViewStack

source: StatusPages with helpful descriptions for all multiplayer screens
pt_br: StatusPages com descrições úteis para todos os telas multijogador
ru: Страницы статуса с полезными описаниями для всех многопользовательских экранов

source: Connection status indicators in header bars
pt_br: Indicadores de estado de conexão nas barras de cabeçalho
ru: Индикаторы состояния подключения в строках заголовка

source: Toast notifications for opponent connection events
pt_br: Notificações toast para eventos de conexão do oponente
ru: Всплывающие уведомления о событиях подключения противника

source: Pill-shaped action buttons in bottom header bars
pt_br: Botões de ação em forma de pílula nas barras de cabeçalho inferiores
ru: Кнопки действий в форме таблеток в нижних панелях заголовков

source: Back navigation buttons with arrow icons
pt_br: Botões de navegação para trás com ícones de seta
ru: Кнопки для возврата с иконками стрелок

source: Settings initialized from user preferences in multiplayer
pt_br: Configurações inicializadas a partir das preferências do usuário em multijogador
ru: Настройки, инициализируемые из пользовательских настроек в многопользовательской игре

source: Removed welcome screen for streamlined experience
pt_br: Tela de boas-vindas removido para uma experiência otimizada
ru: Удален экран приветствия для упрощения работы

source: Bug Fixes
pt_br: Correções de erros
ru: Исправление ошибок

source: Fixed duplicate game end dialogs in multiplayer
pt_br: Diálogos de fim de jogo duplicados corrigidos em multijogador
ru: Исправлено дублирование диалогов о завершении игры в мультиплеере

source: Fixed timer not working in multiplayer games
pt_br: Temporizador corrigido que não funcionava em jogos multijogador
ru: Исправлено, что таймер не работал в многопользовательских играх

source: Fixed variant selection bug (Brazilian → American)
pt_br: Erro de seleção de variante corrigido (Brasileira → Americana)
ru: Исправлена ошибка при выборе варианта (бразильский → американский)

source: Fixed server crash causing application crashes
pt_br: Falha do servidor corrigida que causava falhas da aplicativo
ru: Исправлен сбой сервера, приводивший к сбоям приложений

source: Fixed quick match self-pairing issues
pt_br: Problemas de emparelhamento automático em partida rápida corrigidos
ru: Исправлены проблемы с самосопряжением быстрого матча

source: Improved error handling for offline servers
pt_br: Tratamento de erros melhorado para servidores offline
ru: Улучшена обработка ошибок для автономных серверов

source: Technical Improvements
pt_br: Melhorias técnicas
ru: Технические усовершенствования

source: WebSocket-based multiplayer networking with libsoup-3.0
pt_br: Rede multijogador baseada em WebSocket com libsoup-3.0
ru: Многопользовательская сеть на базе WebSocket с libsoup-3.0

source: Node.js relay server with room management
pt_br: Servidor de retransmissão Node.js com gestão de salas
ru: Node.js ретрансляционный сервер с управлением помещением

source: JSON-based protocol for all multiplayer messages
pt_br: Protocolo baseado em JSON para todas as mensagens multijogador
ru: Протокол на основе JSON для всех многопользовательских сообщений

source: Quick match queue system organized by variant
pt_br: Sistema de fila de partida rápida organizado por variante
ru: Система очереди быстрого матча, организованная по варианту

source: Added node_modules to .gitignore
pt_br: node_modules adicionado ao .gitignore
ru: Добавлены node_modules в .gitignore

source: Mobile-friendly update with improved adaptive design and bug fixes
pt_br: Atualização compatível com dispositivos móveis com design adaptativo melhorado e correções de erros
ru: Обновление для мобильных устройств с улучшенным адаптивным дизайном и исправлением ошибок

source: Full mobile and tablet support with 360px minimum width
pt_br: Suporte completo para dispositivos móveis e tablets com largura mínima de 360px
ru: Полная поддержка мобильных устройств и планшетов с минимальной шириной 360 пикселей

source: Adaptive dialogs with breakpoints for narrow screens
pt_br: Diálogos adaptativos com pontos de interrupção para telas estreitos
ru: Адаптивные диалоги с контрольными точками для узких экранов

source: Game History dialog now uses bottom sheet for filters on mobile
pt_br: O diálogo de Histórico de jogos agora usa uma folha inferior para filtros em dispositivos móveis
ru: Диалог истории игр теперь использует нижнюю панель для фильтров на мобильных устройствах

source: Game Replay dialog optimized with side panel as bottom sheet
pt_br: Diálogo de Repetição de jogo otimizado com painel lateral como folha inferior
ru: Диалог повторного просмотра игры оптимизирован с боковой панелью в виде нижнего листа

source: Speed controls moved to overflow menu on mobile devices
pt_br: Controlos de velocidade movidos para o menu de transbordo em dispositivos móveis
ru: Элементы управления скоростью перенесены в меню переполнения на мобильных устройствах

source: New Game dialog now properly scrollable on small screens
pt_br: O diálogo de Novo jogo agora pode ser deslocado corretamente em telas pequenos
ru: Диалог новой игры теперь правильно прокручивается на маленьких экранах

source: Fixed timer expiration crash - game now ends properly when time runs out
pt_br: Falha por expiração do temporizador corrigida - o jogo agora termina corretamente quando o tempo acaba
ru: Исправлен сбой при истечении таймера — теперь игра правильно заканчивается по истечении времени

source: Improved touch-friendly margins and spacing on mobile
pt_br: Margens e espaçamento melhorados para telas tácteis em dispositivos móveis
ru: Улучшены удобные для сенсорного управления поля и расстояние на мобильных устройствах

source: Better adaptive bottom bar with priority-based element hiding
pt_br: Melhor barra inferior adaptativa com ocultação de elementos baseada em prioridades
ru: Лучше адаптивная нижняя панель с скрытием элементов по приоритету

source: All dialogs now work seamlessly at mobile screen sizes
pt_br: Todos os diálogos agora funcionam perfeitamente em tamanhos de tela móvel
ru: Все диалоги теперь работают без сбоев на размерах экрана мобильных устройств

source: First stable release of Draughts - A comprehensive draughts/checkers game
pt_br: Primeira versão estável de Damas - Um jogo completo de damas
ru: Первый стабильный релиз Draughts - полноценная игра в шашки

source: 16 international game variants: American Checkers, International, Russian, Brazilian, Italian, Spanish, Czech, Thai, German, Swedish, Pool, Turkish, Armenian, Gothic, Frisian, and Canadian
pt_br: 16 variantes internacionais de jogo: Damas Americanas, Internacional, Russa, Brasileira, Italiana, Espanhola, Tcheca, Tailandesa, Alemã, Sueca, Pool, Turca, Armênia, Gótica, Frísica e Canadense
ru: 16 международных вариантов игр: Американские шашки, Международные, Русские, Бразильские, Итальянские, Испанские, Чешские, Тайские, Немецкие, Шведские, Пул, Турецкие, Армянские, Готические, Фризские и Канадские

source: 10 AI difficulty levels from Beginner to Grandmaster with intelligent move evaluation
pt_br: 10 níveis de dificuldade de IA do Iniciante ao Grão-Mestre com avaliação inteligente de movimentos
ru: 10 уровней сложности ИИ — от Начинающего до Гроссмейстера с интеллектуальной оценкой ходов

source: Three gameplay modes: Human vs Human, Human vs AI, and AI vs AI
pt_br: Três modos de jogo: Humano vs Humano, Humano vs IA e IA vs IA
ru: Три режима игры: человек против человека, человек против ИИ и ИИ против ИИ

source: Complete sound effects system with audio feedback for moves, captures, and game events
pt_br: Sistema completo de efeitos sonoros com feedback de áudio para movimentos, capturas e eventos do jogo
ru: Полная система звуковых эффектов для ходов, захватов и игровых событий

source: PDN (Portable Draughts Notation) export for game analysis and sharing
pt_br: Exportação PDN (Portable Draughts Notation) para análise e compartilhamento de jogos
ru: Экспорт PDN (портативной шашечной нотации) для анализа игры и обмена информацией

source: Four piece styles: Plastic, Wood, Metal, and Bottle Cap
pt_br: Quatro estilos de peças: Plástico, Madeira, Metal e Tampinha
ru: Четыре варианта исполнения: Пластик, дерево, металл и крышка от бутылки

source: Five board themes: Classic, Wood, Green, Blue, and High Contrast
pt_br: Cinco temas de tabuleiro: Clássico, Madeira, Verde, Azul e Alto Contraste
ru: Пять тем оформления доски: Классическая, деревянная, зеленая, синяя и контрастная

source: Full move history with unlimited undo/redo support
pt_br: Histórico completo de movimentos com suporte ilimitado para desfazer/refazer
ru: Полная история перемещений с неограниченной поддержкой отмены / повтора

source: Smooth animations and visual feedback for all game actions
pt_br: Animações suaves e feedback visual para todas as ações do jogo
ru: Плавная анимация и визуальная обратная связь для всех игровых действий

source: Keyboard navigation and screen reader accessibility support
pt_br: Navegação por teclado e suporte de acessibilidade para leitores de tela
ru: Поддержка навигации с клавиатуры и специальных возможностей для чтения с экрана

source: Modern GTK4/LibAdwaita interface with adaptive design
pt_br: Interface moderna GTK4/LibAdwaita com design adaptativo
ru: Современный интерфейс GTK4/LibAdwaita с адаптивным дизайном

source: Dark mode support following system theme
pt_br: Suporte para modo escuro seguindo o tema do sistema
ru: Поддержка темного режима в соответствии с системной темой

source: Draughts
pt_br: Damas
ru: Шашки

source: American Checkers
pt_br: Damas Americanas
ru: Американские шашки

source: Undo Move
pt_br: Desfazer Movimento
ru: Отменить перемещение

source: Pause Game
pt_br: Pausar Jogo
ru: Приостановить игру

source: Disconnect from Multiplayer Game
pt_br: Desconectar do jogo multijogador
ru: Отключиться от многопользовательской игры

source: Main Menu
pt_br: Menu Principal
ru: Главное меню

source: Paused
pt_br: Pausado
ru: Приостановлено

source: Press Play to resume
pt_br: Pressione Play para continuar
ru: Нажмите Играть, чтобы продолжить

source: Opponent Disconnected
pt_br: Oponente desconectado
ru: Противник отключен

source: Waiting for reconnection...
pt_br: A aguardar reconexão...
ru: Жду повторного подключения...

source: First Move
pt_br: Primeiro Movimento
ru: Первый ход

source: Previous Move
pt_br: Movimento Anterior
ru: Предыдущий ход

source: Next Move
pt_br: Próximo Movimento
ru: Следующий ход

source: Last Move
pt_br: Último Movimento
ru: Последний ход

source: Navigate to move
pt_br: Navegar para movimento
ru: Перейдите к ходу

source: Game Start
pt_br: Início do Jogo
ru: Старт игры

source: _New Game
pt_br: _Novo Jogo
ru: _Новая игра

source: Play _Online
pt_br: Jogar _Online
ru: Игра _онлайн

source: _Reset Game
pt_br: _Reiniciar Jogo
ru: _Сброс игры

source: Game _History
pt_br: _Histórico de Jogos
ru: История _игры

source: _Preferences
pt_br: _Preferências
ru: _Предпочтения

source: _Help
pt_br: _Ajuda
ru: _Помощь

source: _Keyboard Shortcuts
pt_br: _Atalhos de Teclado
ru: _Клавиатурные сочетания

source: _About Draughts
pt_br: _Sobre Damas
ru: _О Draughts

source: _Quit
pt_br: _Sair
ru: _Выйти

source: Game Complete!
pt_br: Jogo Concluído!
ru: Игра завершена!

source: Game Statistics
pt_br: Estatísticas do Jogo
ru: Игровая статистика

source: Total Moves
pt_br: Total de Movimentos
ru: Общее количество ходов

source: Number of moves played in the game
pt_br: Número de movimentos jogados na partida
ru: Количество ходов, сыгранных в игре

source: Game Duration
pt_br: Duração do Jogo
ru: Продолжительность игры

source: Total time played
pt_br: Tempo total jogado
ru: Общее количество сыгранного времени

source: Red Player Statistics
pt_br: Estatísticas do Jogador Vermelho
ru: Статистика красного игрока

source: Pieces Captured
pt_br: Peças Capturadas
ru: Взятие шашкек

source: Enemy pieces captured
pt_br: Peças inimigas capturadas
ru: Захвачено вражеских шашкек

source: Pieces Promoted
pt_br: Peças Promovidas
ru: Продвижение шашкек

source: Men promoted to kings
pt_br: Peças promovidas a damas
ru: Фигуры стали королями

source: Moves Made
pt_br: Movimentos Realizados
ru: Сделанные ходы

source: Total moves by this player
pt_br: Total de movimentos deste jogador
ru: Общее количество ходов этого игрока

source: Pieces Remaining
pt_br: Peças Restantes
ru: Остаток шашкек

source: Pieces left on the board
pt_br: Peças restantes no tabuleiro
ru: Фигуры, оставшиеся на доске

source: Black Player Statistics
pt_br: Estatísticas do Jogador Preto
ru: Статистика черного игрока

source: New Game
pt_br: Novo Jogo
ru: Новая игра

source: Close
pt_br: Fechar
ru: Закрыть

source: Game History
pt_br: Histórico de Jogos
ru: История игры

source: Filter Games
pt_br: Filtrar Jogos
ru: Фильтр игр

source: Clear History
pt_br: Limpar Histórico
ru: Очистить историю

source: Filter by variant
pt_br: Filtrar por variante
ru: Фильтровать по варианту

source: Filter by result
pt_br: Filtrar por resultado
ru: Фильтровать по результату

source: Filter by player type
pt_br: Filtrar por tipo de jogador
ru: Фильтровать по типу игрока

source: No Games Found
pt_br: Nenhum Jogo Encontrado
ru: Игры не найдены
