Repository: tobagin/Draughts
Catalog: po/*.po
Languages: pt_br, ru

source: Board Colors
pt_br: Cores do Tabuleiro
ru: Цвета доски

source: Choose the color scheme for the board
pt_br: Escolha o esquema de cores do tabuleiro
ru: Выберите цветовую схему доски

source: Customize the appearance of game pieces
pt_br: Personalize a aparência das peças do jogo
ru: Настроить внешний вид шашек

source: Piece Design
pt_br: Design das Peças
ru: Дизайн шашек

source: Choose the visual style for pieces
pt_br: Escolha o estilo visual das peças
ru: Выберите визуальный стиль шашек

source: Configure game history tracking and features
pt_br: Configure o rastreamento de histórico de jogos e recursos
ru: Настроить отслеживание истории игры и функции

source: Enable Game History
pt_br: Habilitar Histórico de Jogos
ru: Включить историю игр

source: Record game histories and enable history menu
pt_br: Gravar históricos de jogos e habilitar menu de histórico
ru: Записывать историю игр и включить меню истории

source: Updates
pt_br: Atualizações
ru: Обновления

source: Configure how the application handles updates
pt_br: Configure como o aplicativo lida com atualizações
ru: Настройте, как приложение обрабатывает обновления

source: Show Release Notes
pt_br: Mostrar Notas de Lançamento
ru: Показывать примечания к выпуску

source: Display what's new when the application is updated
pt_br: Exibir novidades quando o aplicativo for atualizado
ru: Отображать информацию о новых доступных обновлениях

source: Classic Brown/Beige
pt_br: Marrom/Bege Clássico
ru: Классический коричневый/бежевый

source: Wood Light/Dark
pt_br: Madeira Clara/Escura
ru: Дерево светлое/тёмное

source: Green/White
pt_br: Verde/Branco
ru: Зелёный/Белый

source: Blue/Gray
pt_br: Azul/Cinza
ru: Синий/Серый

source: Plastic
pt_br: Plástico
ru: Пластик

source: Wood
pt_br: Madeira
ru: Дерево

source: Metal
ru: Метал

source: Bottle Cap
pt_br: Tampinha
ru: Крышка бутылки

source: Follow System
pt_br: Seguir Sistema
ru: В соответствии с системой

source: Light
pt_br: Claro
ru: Свтлая

source: Dark
pt_br: Escuro
ru: Тёмная

source: Game Rules Changed
pt_br: Regras do Jogo Alteradas
ru: Правила игры изменились

source: You have selected a new draughts variant. Here are the key rules for this variant:
pt_br: Você selecionou uma nova variante de damas. Aqui estão as regras principais desta variante:
ru: Вы выбрали новую разновидность шашек. Вот основные правила этой разновидности:

source: Variant Information
pt_br: Informações da Variante
ru: Информация о варианте

source: Variant Name
pt_br: Nome da Variante
ru: Название варианта

source: Board Size
pt_br: Tamanho do Tabuleiro
ru: Размер доски

source: Starting Pieces per Player
pt_br: Peças Iniciais por Jogador
ru: Начальные шашки для каждого игрока

source: Movement Rules
pt_br: Regras de Movimento
ru: Правила ходов

source: Men Movement
pt_br: Movimento das Peças
ru: Ходы пешек

source: Kings Movement
pt_br: Movimento das Damas
ru: Ходы дамок

source: Kings Can Fly
pt_br: Damas Podem Voar
ru: Дамки могут летать

source: Capture Rules
pt_br: Regras de Captura
ru: Правила захвата

source: Men Capture
pt_br: Captura de Peças
ru: Захват пешек

source: Kings Capture
pt_br: Captura de Damas
ru: Захват дамок

source: Mandatory Capture
pt_br: Captura Obrigatória
ru: Обязательный захват

source: Capture Priority
pt_br: Prioridade de Captura
ru: Приоритет захвата

source: Multiple Captures
pt_br: Capturas Múltiplas
ru: Множественные захваты

source: Promotion Rules
pt_br: Regras de Promoção
ru: Правила ходов

source: Promotion Condition
pt_br: Condição de Promoção
ru: Условия ходов

source: Promotion Timing
pt_br: Momento da Promoção
ru: Время хода

source: Continue with New Rules
pt_br: Continuar com Novas Regras
ru: Продолжить с новыми правилами

source: Keep Current Variant
pt_br: Manter Variante Atual
ru: Сохранить текущий вариант

source: Select Game Variant
pt_br: Selecionar Variante do Jogo
ru: Выбор варианта игры

source: Select
pt_br: Selecionar
ru: Выбор

source: Choose a draughts variant:
pt_br: Escolha uma variante de damas:
ru: Выберите вариант шашек:

source: Variant Details
pt_br: Detalhes da Variante
ru: Подробности варианта

source: Select a variant
pt_br: Selecione uma variante
ru: Выберите вариант

source: 0 moves
pt_br: 0 movimentos
ru: 0 ходов

source: Go to first move
pt_br: Ir para o primeiro movimento
ru: Переход к первому ходу

source: Previous move
pt_br: Movimento anterior
ru: Предыдущий ход

source: Next move
pt_br: Próximo movimento
ru: Следующий ход

source: Go to last move
pt_br: Ir para o último movimento
ru: Переход к последнему ходу

source: Export game in PGN format
pt_br: Exportar jogo em formato PGN
ru: Экспортировать игру в формат PGN

source: Clear
pt_br: Limpar
ru: Очистка

source: Clear move history
pt_br: Limpar histórico de movimentos
ru: Очистить историю ходов

source: Game duration: 0:00
pt_br: Duração do jogo: 0:00
ru: Продолжительность игры: 0:00

source: Timer settings
pt_br: Configurações do cronômetro
ru: Настройки таймера

source: Resume Game
pt_br: Retomar Jogo
ru: Возобновить игру

source: Multiplayer Connection Lost
pt_br: Conexão multijogador perdida
ru: Потеряно многопользовательское соединение

source: Opponent disconnected. Waiting for reconnection...
pt_br: Oponente desconectado. A aguardar reconexão...
ru: Противник отключился. Ожидание повторного подключения...

source: Opponent reconnected!
pt_br: Oponente reconectado!
ru: Противник снова подключился!

source: PDN Import
pt_br: Importação PDN
ru: Импорт в PDN

source: PDN file import functionality will be available in a future version. File: %s
pt_br: A funcionalidade de importação de arquivo PDN estará disponível em uma versão futura. Arquivo: %s
ru: Функция импорта файлов PDN будет доступна в будущей версии. Файл: %s

source: Failed to open file: %s
pt_br: Falha ao abrir arquivo: %s
ru: Не удалось открыть файл: %s

source: Searching for opponent...
pt_br: A procurar oponente...
ru: В поисках противника...

source: Creating room...
pt_br: A criar sala...
ru: Создание комнаты...

source: Joining room...
pt_br: A juntar-se à sala...
ru: Присоединение к комнате...

source: Connecting...
pt_br: A conectar...
ru: Соединение ...

source: Reconnecting...
pt_br: A reconectar...
ru: Повторное подключение...

source: Disconnected
pt_br: Desconectado
ru: Отключен

source: Connection error
pt_br: Erro de conexão
ru: Ошибка подключения

source: Error
pt_br: Erro
ru: Ошибка

source: Information
pt_br: Informação
ru: Информация

source: Canadian Checkers
pt_br: Damas canadianas
ru: Канадские шашки

source: 8×8 board with 64 squares
pt_br: Tabuleiro 8×8 com 64 casas
ru: Доска размером 8 × 8 на 64 квадрата

source: 12 pieces per player
pt_br: 12 peças por jogador
ru: По 12 фигур на каждого игрока

source: Diagonally forward only, one square
pt_br: Diagonalmente apenas para frente, uma casa
ru: Только вперед по диагонали, на один квадрат

source: Diagonally forward and backward, one square
pt_br: Diagonalmente para frente e para trás, uma casa
ru: По диагонали вперед и назад, на один квадрат

source: No - kings move one square at a time
pt_br: Não - damas movem-se uma casa por vez
ru: Без дамок ход на одну клетку за раз

source: Diagonally forward only, must jump over enemy piece
pt_br: Diagonalmente apenas para frente, deve pular sobre peça inimiga
ru: Ход только вперед по диагонали, необходимо перепрыгнуть через вражескую шашку

source: Diagonally in any direction, must jump over enemy piece
pt_br: Diagonalmente em qualquer direção, deve pular sobre peça inimiga
ru: Ход по диагонали в любом направлении, необходимо перепрыгнуть через вражескую шашку

source: Yes - must capture if possible
pt_br: Sim - deve capturar se possível
ru: Да - необходимо захватить, если это возможно

source: Maximum number of pieces must be captured
pt_br: Número máximo de peças deve ser capturado
ru: Необходимо захватить максимальное количество шашек

source: Yes - continue jumping with same piece if possible
pt_br: Sim - continue pulando com a mesma peça se possível
ru: Да - продолжайте прыгать с той же шашкой, если это возможно

source: Reach opposite end of board
pt_br: Alcançar o lado oposto do tabuleiro
ru: Доберитесь до противоположного конца доски

source: Immediately when reaching promotion square
pt_br: Imediatamente ao alcançar a casa de promoção
ru: Сразу же по прибытии на конечный квадрат

source: 10×10 board with 100 squares
pt_br: Tabuleiro 10×10 com 100 casas
ru: Доска размером 10×10 на 100 квадратов

source: 20 pieces per player
pt_br: 20 peças por jogador
ru: По 20 шашек на каждого игрока

source: Diagonally in any direction, any distance
pt_br: Diagonalmente em qualquer direção, qualquer distância
ru: По диагонали в любом направлении, на любом расстоянии

source: Yes - kings can move multiple squares
pt_br: Sim - damas podem mover-se múltiplas casas
ru: Да - дамки могут ходить на несколько клеток

source: Diagonally in any direction, can land anywhere after jumped piece
pt_br: Diagonalmente em qualquer direção, pode pousar em qualquer lugar após peça pulada
ru: По диагонали в любом направлении, может остановиться в любом месте после прыжка

source: Diagonally forward and backward, must jump over enemy piece
pt_br: Diagonalmente para frente e para trás, deve pular sobre peça inimiga
ru: Двигаясь по диагонали вперед и назад, необходимо перепрыгивать через вражескую фигуру

source: Diagonally forward only, cannot capture kings
pt_br: Diagonalmente apenas para frente, não pode capturar damas
ru: Только вперед по диагонали, нельзя захватывать дамок

source: Kings have priority over men in captures
pt_br: Damas têm prioridade sobre peças nas capturas
ru: Дамки имеют преимущество перед пешками в захвате

source: Diagonally forward AND backward - unique to Spanish variant
pt_br: Diagonalmente para frente E para trás - exclusivo da variante espanhola
ru: По диагонали вперед и назад - только для испанского варианта

source: Player chooses any legal capture
pt_br: Jogador escolhe qualquer captura legal
ru: Игрок выбирает любой доступный захват

source: Czech Draughts (8×8)
pt_br: Damas Tchecas (8×8)
ru: Чешские шашки (8×8)

source: Thai Draughts (8×8)
pt_br: Damas Tailandesas (8×8)
ru: Тайские шашки (8×8)

source: German Draughts (8×8)
pt_br: Damas Alemãs (8×8)
ru: Немецкие шашки (8×8)

source: Swedish Draughts (10×10)
pt_br: Damas Suecas (10×10)
ru: Шведские шашки (10×10)

source: Pool Checkers (8×8)
ru: Бильярдные шашки (8×8)

source: Turkish Draughts (8×8)
pt_br: Damas Turcas (8×8)
ru: Турецкие Шашки (8×8)

source: Armenian Draughts (8×8)
pt_br: Damas Armênias (8×8)
ru: Армянские шашки (8×8)

source: Gothic Draughts (8×8)
pt_br: Damas Góticas (8×8)
ru: Готические шашки (8×8)

source: Frisian Draughts (10×10)
pt_br: Damas Frísicas (10×10)
ru: Фризские шашки (10×10)

source: Canadian Draughts (12×12)
pt_br: Damas Canadenses (12×12)
ru: Канадские шашки (12×12)

source: 12×12 board with 144 squares
pt_br: Tabuleiro 12×12 com 144 casas
ru: Доска размером 12×12 дюймов со 144 квадратами

source: 30 pieces per player
pt_br: 30 peças por jogador
ru: 30 шашек на игрока

source: All Variants
pt_br: Todas as Variantes
ru: Все варианты

source: All Results
pt_br: Todos os Resultados
ru: Все результаты

source: Red Wins
pt_br: Vermelho Vence
ru: Красный победил

source: Black Wins
pt_br: Preto Vence
ru: Чёрный победил

source: Draws
pt_br: Empates
ru: Ничья

source: All Games
pt_br: Todos os Jogos
ru: Все игры

source: Human vs Human
pt_br: Humano vs Humano
ru: Человек против человека

source: vs Computer
pt_br: vs Computador
ru: против компьютера

source: Clear Game History
pt_br: Limpar Histórico de Jogos
ru: Очистить историю игр

source: Are you sure you want to delete all game history? This action cannot be undone.
pt_br: Tem certeza de que deseja excluir todo o histórico de jogos? Esta ação não pode ser desfeita.
ru: Уверены, что хотите удалить всю историю игр? Это действие не может быть отменено.

source: Export Game History
pt_br: Exportar Histórico de Jogos
ru: Экспорт истории игры

source: Game history exported successfully
pt_br: Histórico de jogos exportado com sucesso
ru: История игры успешно экспортирована

source: Failed to export game history
pt_br: Falha ao exportar histórico de jogos
ru: Не удалось экспортировать историю игр

source: Export Game
pt_br: Exportar Jogo
ru: Экспортировать игру

source: Game exported successfully
pt_br: Jogo exportado com sucesso
ru: Игра успешно экспортирована

source: Failed to export game
pt_br: Falha ao exportar jogo
ru: Не удалось экспортировать игру

source: Delete Game
pt_br: Excluir Jogo
ru: Удалить игру

source: Game deleted
pt_br: Jogo excluído
ru: Игра удалена

source: Done
pt_br: Concluído
ru: Готово

source: Game Variant
pt_br: Variante de jogo
ru: Вариант игры

source: Game Result
pt_br: Resultado do jogo
ru: Результат игры

source: Result
pt_br: Resultado
ru: Результат

source: Player Type
pt_br: Tipo de jogador
ru: Тип игрока

source: Players
pt_br: Jogadores
ru: Игроки

source: No game data available
pt_br: Nenhum dado de jogo disponível
ru: Нет доступных игровых данных

source: Pause
pt_br: Pausar
ru: Пауза

source: Play
pt_br: Reproduzir
ru: Играть

source: Export Game Replay
pt_br: Exportar Replay do Jogo
ru: Экспортировать повтор игры

source: Red Player Wins!
pt_br: Jogador Vermelho Vence!
ru: Красный игрок побелил!

source: Congratulations on your victory!
pt_br: Parabéns pela sua vitória!
ru: Поздравляем вас с победой!

source: Black Player Wins!
pt_br: Jogador Preto Vence!
ru: Черный игрок победил!

source: Game Drawn!
pt_br: Jogo Empatado!
ru: Игра сыграна вничью!

source: Well played by both sides!
pt_br: Bem jogado por ambos os lados!
ru: Хорошая игра с обеих сторон!

source: Game Ended
pt_br: Jogo Finalizado
ru: Игра окончена

source: Thanks for playing!
pt_br: Obrigado por jogar!
ru: Спасибо за игру!

source: Critical Error
pt_br: Erro Crítico
ru: Критическая ошибка

source: Quit Application
pt_br: Sair do Aplicativo
ru: Выйти из приложения

source: Confirm
pt_br: Confirmar
ru: Подтвердить
