Repository: tobagin/Draughts
Catalog: po/*.po
Languages: pt_br, ru

source: Play some games to see them in your history
pt_br: Jogue algumas partidas para vê-las em seu histórico
ru: Поиграйте в несколько игр, чтобы увидеть их в своей истории

source: Watch Replay
pt_br: Assistir Replay
ru: Смотреть повтор

source: View Details
pt_br: Ver Detalhes
ru: Просмотр подробной информации

source: Export PGN
pt_br: Exportar PGN
ru: Экспорт PGN

source: Delete
pt_br: Excluir
ru: Удалить

source: Game Preferences
pt_br: Preferências do Jogo
ru: Предпочтения игры

source: General
pt_br: Geral
ru: Главные

source: Game Settings
pt_br: Configurações do Jogo
ru: Настройки игры

source: Default Variant
pt_br: Variante Padrão
ru: Вариант по умолчанию

source: Choose the default draughts variant
pt_br: Escolha a variante padrão de damas
ru: Выберите вариант шашек по умолчанию

source: Show Legal Moves
pt_br: Mostrar Movimentos Legais
ru: Показать возможные ходы

source: Highlight possible moves for selected pieces
pt_br: Destacar movimentos possíveis para peças selecionadas
ru: Выделить возможные ходы для выбранных шашек

source: Animate Moves
pt_br: Animar Movimentos
ru: Анимация ходов

source: Animate piece movements
pt_br: Animar movimentos das peças
ru: Анимация движения шашек

source: Sound Effects
pt_br: Efeitos Sonoros
ru: Звуковые эффекты

source: Play sounds for moves and captures
pt_br: Reproduzir sons para movimentos e capturas
ru: Воспроизводить звук ходов и захватов

source: Interaction Mode
pt_br: Modo de Interação
ru: Режим взаимодействия

source: Choose how to select and move pieces
pt_br: Escolha como selecionar e mover peças
ru: Выберите, как выделять и перемещать шашки

source: AI Settings
pt_br: Configurações de IA
ru: Настройки ИИ

source: AI Difficulty
pt_br: Dificuldade da IA
ru: Сложность с ИИ

source: Set the computer opponent difficulty
pt_br: Defina a dificuldade do oponente computador
ru: Установить уровень сложности компьютерного противника

source: AI Thinking Time
pt_br: Tempo de Pensamento da IA
ru: Время на обдумывание ИИ

source: Maximum time for AI to think (seconds)
pt_br: Tempo máximo para a IA pensar (segundos)
ru: Максимальное время, затрачиваемое ИИ на обдумывание (секунды)

source: Show AI Thinking
pt_br: Mostrar Pensamento da IA
ru: Показать мышление ИИ

source: Display AI analysis during its turn
pt_br: Exibir análise da IA durante sua vez
ru: Отображать анализ искусственного интеллекта во время его хода

source: AI Progress Indicator
pt_br: Indicador de Progresso da IA
ru: Индикатор прогресса искусственного интеллекта

source: Show progress while AI is thinking
pt_br: Mostrar progresso enquanto a IA está pensando
ru: Показывайте прогресс, пока ИИ думает

source: Timers
pt_br: Cronômetros
ru: Таймер

source: Timer Settings
pt_br: Configurações do Cronômetro
ru: Настройки таймера

source: Default Timer Mode
pt_br: Modo de Cronômetro Padrão
ru: Режим таймера по умолчанию

source: Choose the default timing method
pt_br: Escolha o método de cronometragem padrão
ru: Выберать метод таймера по умолчанию

source: Countdown Time
pt_br: Tempo de Contagem Regressiva
ru: Обратный отсчет

source: Minutes per player for countdown timer
pt_br: Minutos por jogador para cronômetro de contagem regressiva
ru: Минуты на игрока для таймера обратного отсчёта

source: Fischer Increment
pt_br: Incremento Fischer
ru: Приращение Фишера

source: Seconds added per move in Fischer mode
pt_br: Segundos adicionados por movimento no modo Fischer
ru: Секунды добавляются за ход в режиме Фишера

source: Timer Warnings
pt_br: Avisos do Cronômetro
ru: Предупреждения таймера

source: Show warnings when time is running low
pt_br: Mostrar avisos quando o tempo está acabando
ru: Показывать предупреждения, когда время заканчивается

source: Delay Time
pt_br: Tempo de Atraso
ru: Время задержки

source: Seconds of delay before clock starts
pt_br: Segundos de atraso antes do cronômetro começar
ru: Секунды задержки перед запуском часов

source: Timer Sounds
pt_br: Sons do Cronômetro
ru: Звуки таймера

source: Play sounds for timer events
pt_br: Reproduzir sons para eventos do cronômetro
ru: Воспроизводить звуки таймера

source: Display
pt_br: Exibição
ru: Показать

source: Appearance
pt_br: Aparência
ru: Внешность

source: Piece Style
pt_br: Estilo das Peças
ru: Стиль шашки

source: Choose the visual style for game pieces
pt_br: Escolha o estilo visual das peças do jogo
ru: Выбрать стиль игровых фигур

source: Show Coordinates
pt_br: Mostrar Coordenadas
ru: Показывать координаты

source: Display board coordinates (A1, B2, etc.)
pt_br: Exibir coordenadas do tabuleiro (A1, B2, etc.)
ru: Показать координаты на доске (A1, B2 и т.д.)

source: Highlight Last Move
pt_br: Destacar Último Movimento
ru: Выделить последний ход

source: Highlight the most recent move
pt_br: Destacar o movimento mais recente
ru: Выделить самый последний шаг

source: Show Move History
pt_br: Mostrar Histórico de Movimentos
ru: Показать историю ходов

source: Display the move history panel
pt_br: Exibir o painel de histórico de movimentos
ru: Отобразить панель истории ходов

source: Board Theme
pt_br: Tema do Tabuleiro
ru: Тема доски

source: Choose the visual style for the game board
pt_br: Escolha o estilo visual do tabuleiro de jogo
ru: Выберите визуальный стиль для игрового поля

source: Accessibility
pt_br: Acessibilidade
ru: Доступно

source: High Contrast
pt_br: Alto Contraste
ru: Высокая контрастность

source: Use high contrast colors
pt_br: Usar cores de alto contraste
ru: Использовать цвета с высокой контрастностью

source: Large Pieces
pt_br: Peças Grandes
ru: Крупные шашки

source: Use larger piece graphics
pt_br: Usar gráficos de peças maiores
ru: Использовать шашки большего размера

source: Keyboard Navigation
pt_br: Navegação por Teclado
ru: Навигация с помощью клавиатуры

source: Enable keyboard control of the board
pt_br: Habilitar controle do tabuleiro por teclado
ru: Включить управление доской с клавиатуры

source: Move Announcements
pt_br: Anúncios de Movimento
ru: Объявления хода

source: Level of move descriptions for screen readers
pt_br: Nível de descrições de movimento para leitores de tela
ru: Уровень описания ходов для программ чтения с экрана

source: Screen Reader Support
pt_br: Suporte para Leitor de Tela
ru: Поддержка программы чтения с экрана

source: Enhanced support for screen reader software
pt_br: Suporte aprimorado para software de leitor de tela
ru: Расширенная поддержка программного обеспечения для чтения с экрана

source: Game Replay
pt_br: Replay do Jogo
ru: Повтор игры

source: Show Game Information
pt_br: Mostrar informação do jogo
ru: Показать информацию об игре

source: Replay Options
pt_br: Opções de Replay
ru: Параметры повтора

source: Loading board...
pt_br: Carregando tabuleiro...
ru: Загрузка доски...

source: Go to Start
pt_br: Ir para o Início
ru: Перейти к началу

source: Play/Pause
pt_br: Reproduzir/Pausar
ru: Воспроизвести/Пауза

source: Go to End
pt_br: Ir para o Fim
ru: Перейти к концу

source: Playback Speed
pt_br: Velocidade de Reprodução
ru: Скорость воспроизведения

source: Speed
pt_br: Velocidade
ru: Скорость

source: Move Position
pt_br: Posição do Movimento
ru: Переместить позицию

source: Game Information
pt_br: Informações do Jogo
ru: Информация об игре

source: Variant
pt_br: Variante
ru: Вариант

source: Current Move
pt_br: Movimento Atual
ru: Текущий ход

source: Red Player
pt_br: Jogador Vermelho
ru: Красный игрок

source: Black Player
pt_br: Jogador Preto
ru: Чёрный игрок

source: Move History
pt_br: Histórico de Movimentos
ru: История ходов

source: Click a move to jump to that position
pt_br: Clique em um movimento para pular para aquela posição
ru: Нажмите на ход, чтобы перейти к этой позиции

source: 0.25× (Very Slow)
pt_br: 0,25× (Muito lento)
ru: 0.25× (очень медленно)

source: 0.5× (Slow)
pt_br: 0,5× (Lento)
ru: 0.5× (мдленно)

source: 1× (Normal)
ru: 1× (нормально)

source: 2× (Fast)
pt_br: 2× (Rápido)
ru: 2× (быстро)

source: 4× (Very Fast)
pt_br: 4× (Muito rápido)
ru: 4× (очень быстро)

source: Export Game (PGN)
pt_br: Exportar Jogo (PGN)
ru: Экспортировать игру (PGN)

source: Copy Game Notation
pt_br: Copiar Notação do Jogo
ru: Скопировать игровую нотацию

source: Reset View
pt_br: Redefinir Visualização
ru: Сбросить вид

source: Auto-rotate Board
pt_br: Rotacionar Tabuleiro Automaticamente
ru: Автоповорот доски

source: Help
pt_br: Ajuda
ru: Помощь

source: Getting Started
pt_br: Começando
ru: Приступая к работе

source: Getting Started with Draughts
pt_br: Começando com Damas
ru: Начало работы с Draughts

source: Welcome to Draughts! This guide will help you start playing.
pt_br: Bem-vindo ao Damas! Este guia vai ajudá-lo a começar a jogar.
ru: Добро пожаловать в шашки! Это руководство поможет вам начать играть.

source: Starting a New Game
pt_br: Iniciando um Novo Jogo
ru: Начало новой игры

source: 1. Click the menu button (☰) in the top-right corner 2. Select 'New Game' 3. Choose your preferred variant (16 available) 4. Select game mode (Human vs Human, Human vs AI, or AI vs AI) 5. For AI games, choose difficulty level (Beginner to Grandmaster) 6. Click 'Start Game'
pt_br: 1. Clique no botão de menu (☰) no canto superior direito 2. Selecione 'Novo Jogo' 3. Escolha sua variante preferida (16 disponíveis) 4. Selecione o modo de jogo (Humano vs Humano, Humano vs IA ou IA vs IA) 5. Para jogos com IA, escolha o nível de dificuldade (Iniciante a Grão-Mestre) 6. Clique em 'Iniciar Jogo'
ru: 1. Нажмите кнопку меню (☰) в правом верхнем углу 2. Выберите 'Новая игра' 3. Выберите предпочитаемый вариант (доступно 16 вариантов). 4. Выберите режим игры (Человек против человека, Человек против ИИ или ИИ против ИИ) 5. Для игр с искусственным интеллектом выберите уровень сложности (от новичка до гроссмейстера) 6. Нажмите 'Начать игру'

source: Basic Rules
pt_br: Regras Básicas
ru: Основные правила

source: • Pieces move diagonally on dark squares • Regular pieces (men) typically move forward only • Capture opponent pieces by jumping over them • Reach the opposite end to promote to a king • Kings can move and capture in more directions • Captures are usually mandatory when available • Win by capturing all opponent pieces or blocking all moves
pt_br: • As peças se movem diagonalmente nas casas escuras • Peças regulares normalmente se movem apenas para frente • Capture peças oponentes pulando sobre elas • Alcance o lado oposto para promover a dama • Damas podem se mover e capturar em mais direções • Capturas geralmente são obrigatórias quando disponíveis • Vença capturando todas as peças oponentes ou bloqueando todos os movimentos
ru: • Шашки перемещаются по диагонали на темных клетках • Обычные шашки перемещаются только вперёд • Захватывайте шашки противника, перепрыгивая через них • Достигайте противоположной стороны доски для получения статуса дамки • Дамки могут передвигаться и захватывать в большем количестве клеток • Захваты обычно обязательны, если они доступны • Вы победили, если захвачены все фигуры противника или блокированы все ходы

source: Game Controls
pt_br: Controles do Jogo
ru: Управление игрой

source: • Click a piece to select it • Click a highlighted square to move • Use Undo/Redo buttons to review moves • Access Preferences to customize appearance • Export games in PDN format for analysis
pt_br: • Clique em uma peça para selecioná-la • Clique em uma casa destacada para mover • Use os botões Desfazer/Refazer para revisar movimentos • Acesse Preferências para personalizar a aparência • Exporte jogos em formato PDN para análise
ru: • Нажмите на фигуру, чтобы выбрать ее • Нажмите на выделенный квадрат, чтобы переместить • Используйте кнопки отмены / повтора для просмотра ходов • Откройте настройки для настройки оформления • Экспорт игр в формате PDN для анализа

source: Variants
pt_br: Variantes
ru: Варианты

source: Game Variants
pt_br: Variantes do Jogo
ru: Варианты игры

source: Draughts includes 16 international variants, each with unique rules:
pt_br: Damas inclui 16 variantes internacionais, cada uma com regras únicas:
ru: Шашки включают в себя 16 международных разновидностей, каждая из которых имеет свои правила:

source: American Checkers (8×8)
pt_br: Damas Americanas (8×8)
ru: Американские шашки (8×8)

source: Most popular in North America. Men move forward only, kings don't fly. Players choose which capture to make.
pt_br: Mais popular na América do Norte. Peças movem-se apenas para frente, damas não voam. Jogadores escolhem qual captura fazer.
ru: Самый популярный в Северной Америке. Шашки ходят только вперед, дамки не летают. Игроки сами выбирают, какой захват сделать.

source: International Draughts (10×10)
pt_br: Damas Internacionais (10×10)
ru: Международные шашки (10×10)

source: Official world championship variant. Flying kings, longest sequence rule. Most complex and strategic.
pt_br: Variante oficial do campeonato mundial. Damas voadoras, regra da sequência mais longa. Mais complexa e estratégica.
ru: Официальный вариант чемпионата мира. Летающие дамки, правило самой длинной последовательности. Самый сложный и стратегический.

source: Russian Draughts (8×8)
pt_br: Damas Russas (8×8)
ru: Русские шашки (8×8)

source: Similar to International but on 8×8 board. Flying kings with longest sequence capture rule.
pt_br: Similar às Damas Internacionais mas em tabuleiro 8×8. Damas voadoras com regra de captura de sequência mais longa.
ru: Похож на международные, но на доске размером 8× 8. Летающие дамки с правилом захвата самой длинной последовательности.

source: Brazilian Draughts (8×8)
pt_br: Damas Brasileiras (8×8)
ru: Бразильские шашки (8×8)

source: Same rules as International Draughts but played on 8×8 board. Popular in South America.
pt_br: Mesmas regras das Damas Internacionais mas jogadas em tabuleiro 8×8. Popular na América do Sul.
ru: Правила те же, что и в международных шашках, но играется на доске 8×8. Популярен в Южной Америке.

source: Italian Draughts (8×8)
pt_br: Damas Italianas (8×8)
ru: Итальянские шашки (8×8)

source: Traditional Italian variant. Must capture maximum pieces. Men cannot capture kings.
pt_br: Variante tradicional italiana. Deve capturar o máximo de peças. Peças não podem capturar damas.
ru: Традиционный итальянский вариант. Необходимо захватить как можно больше фигур. Шашки не могут захватить дамок.

source: Spanish Draughts (8×8)
pt_br: Damas Espanholas (8×8)
ru: Испанские шашки (8×8)

source: Unique rule: men can capture backwards. Kings don't fly. Popular in Spain and Latin America.
pt_br: Regra única: peças podem capturar para trás. Damas não voam. Popular na Espanha e América Latina.
ru: Шашки могут делать захваты задом наперед. Дамки не летают. Популярен в Испании и Латинской Америке.

source: Other Variants
pt_br: Outras Variantes
ru: Другие варианты

source: • Czech Draughts (8×8) - Flying kings, longest sequence • Thai Draughts (8×8) - Kings don't fly, longest sequence • German Draughts (8×8) - Flying kings, similar to Russian • Swedish Draughts (10×10) - Scandinavian variant • Pool Checkers (8×8) - American variant with optional rules • Turkish Draughts (8×8) - Orthogonal movement variant • Armenian Draughts (8×8) - Middle Eastern variant • Gothic Draughts (8×8) - Medieval European rules • Frisian Draughts (10×10) - Dutch regional variant • Canadian Draughts (12×12) - Largest board variant
pt_br: • Damas Tchecas (8×8) - Damas voadoras, sequência mais longa • Damas Tailandesas (8×8) - Damas não voam, sequência mais longa • Damas Alemãs (8×8) - Damas voadoras, similar às Russas • Damas Suecas (10×10) - Variante escandinava • Pool Checkers (8×8) - Variante americana com regras opcionais • Damas Turcas (8×8) - Variante com movimento ortogonal • Damas Armênias (8×8) - Variante do Oriente Médio • Damas Góticas (8×8) - Regras medievais europeias • Damas Frísicas (10×10) - Variante regional holandesa • Damas Canadenses (12×12) - Variante de tabuleiro maior
ru: • Чешские шашки (8×8) - летающие дамки, самая длинная последовательность • Тайские шашки (8×8) - дамки не летают, самая длинная последовательность • Немецкие шашки (8×8) - летающие дамки, похожие на русские • Шведские шашки (10×10) - скандинавский вариант • Бильярдные шашки (8×8) - американский вариант с необязательными правилами • Турецкие Шашки (8×8) - вариант с ортогональным движением • Армянские шашки (8×8) - ближневосточный вариант • Готические шашки (8×8) - средневековые европейские правила • Фризские шашки (10×10) - голландский региональный вариант • Канадские шашки (12×12) - вариант на самой крупной доске

source: Keyboard
pt_br: Teclado
ru: Клавиатура

source: Keyboard Shortcuts
pt_br: Atalhos de Teclado
ru: Клавиатурные сочетания

source: Redo Move
pt_br: Refazer Movimento
ru: Повторить ход

source: Preferences
pt_br: Preferências
ru: Предпочтения

source: Quit
pt_br: Sair
ru: Выйти

source: Window Controls
pt_br: Controles da Janela
ru: Управление окном

source: Close Window
pt_br: Fechar Janela
ru: Закрыть окно

source: About
pt_br: Sobre
ru: О

source: About Draughts
pt_br: Sobre Damas
ru: О Draughts

source: A comprehensive draughts/checkers game for GNOME
pt_br: Um jogo completo de damas para GNOME
ru: Комплексная игра в шашки для GNOME

source: Features
pt_br: Recursos
ru: Особенности

source: • 16 international game variants • 10 AI difficulty levels • Multiple game modes • Complete sound effects • PDN game export • Beautiful themes • Accessibility support • Modern GTK4/LibAdwaita interface
pt_br: • 16 variantes internacionais de jogo • 10 níveis de dificuldade de IA • Múltiplos modos de jogo • Efeitos sonoros completos • Exportação de jogos PDN • Temas bonitos • Suporte de acessibilidade • Interface moderna GTK4/LibAdwaita
ru: 16 международных вариантов игры • 10 уровней сложности с искусственным интеллектом • Несколько режимов игры • Звуковые эффекты • Экспорт игры по PDN • Красивые темы оформления • Поддержка специальных возможностей • Современный интерфейс GTK4/LibAdwaita

source: Version 1.0.0
pt_br: Versão 1.0.0
ru: Версия 1.0.0

source: Licensed under GPL-3.0+
pt_br: Licenciado sob GPL-3.0+
ru: Лицензировано по GPL-3.0+

source: Play Online
pt_br: Jogar Online
ru: Игра онлайн

source: Not connected
pt_br: Não conectado
ru: Нет подключения

source: Multiplayer
pt_br: Multijogador
ru: Многопользовательский

source: Play draughts with opponents online
pt_br: Jogue damas com oponentes online
ru: Играйте в шашки с противниками онлайн

source: Host Game
pt_br: Criar partida
ru: Хост игра

source: Create a new game room
pt_br: Criar uma nova sala de jogo
ru: Создайте новую игровую комнату

source: Join Game
pt_br: Juntar-se a partida
ru: Присоединяйтесь к игре

source: Join an existing game room
pt_br: Juntar-se a uma sala de jogo existente
ru: Присоединяйтесь к существующей игровой комнате

source: Quick Match
pt_br: Partida rápida
ru: Быстрое совпадение

source: Find a random opponent (coming soon)
pt_br: Encontrar um oponente aleatório (em breve)
ru: Найти случайного противника (скоро будет)

source: Connected
pt_br: Conectado
ru: Подключенный

source: Back
pt_br: Voltar
ru: Назад

source: Configure your game settings and create a room
pt_br: Configure as definições do seu jogo e crie uma sala
ru: Настроить игру и создать комнату

source: International Draughts
pt_br: Damas Internacionais
ru: Международные шашки

source: Russian Draughts
pt_br: Damas Russas
ru: Русские шашки

source: Brazilian Draughts
pt_br: Damas Brasileiras
ru: Бразильские шашки

source: Italian Draughts
pt_br: Damas Italianas
ru: Итальянские шашки

source: Spanish Draughts
pt_br: Damas Espanholas
ru: Испанские шашки

source: Czech Draughts
pt_br: Damas Tchecas
ru: Чешские шашки

source: Thai Draughts
pt_br: Damas Tailandesas
ru: Тайские шашки

source: German Draughts
pt_br: Damas Alemãs
ru: Немецкие шашки

source: Swedish Draughts
pt_br: Damas Suecas
ru: Шведские шашки

source: Pool Checkers
ru: Бильярдные шашки

source: Turkish Draughts
pt_br: Damas Turcas
ru: Турецкие шашки

source: Armenian Draughts
pt_br: Damas Armênias
ru: Армянские шашки

source: Gothic Draughts
pt_br: Damas Góticas
ru: Готические шашки

source: Frisian Draughts
pt_br: Damas Frísicas
ru: Фризские шашки

source: Canadian Draughts
pt_br: Damas Canadenses
ru: Канадские шашки

source: Use Timer
pt_br: Usar temporizador
ru: Использовать таймер

source: Add time limits to the game
pt_br: Adicionar limites de tempo ao jogo
ru: Добавьте в игру ограничения по времени

source: Minutes per Side
pt_br: Minutos por lado
ru: Минуты на сторону

source: Increment (seconds)
pt_br: Incremento (segundos)
ru: Приращение (секунды)

source: Time added after each move
pt_br: Tempo adicionado após cada jogada
ru: Время добавляется после каждого хода

source: Clock Type
pt_br: Tipo de Relógio
ru: Тип часов

source: Timer mode for the game
pt_br: Modo de temporizador para o jogo
ru: Режим таймера для игры

source: Fischer (add time after move)
pt_br: Fischer (adicionar tempo após jogada)
ru: Фишер (добавляет время после хода)

source: Bronstein (delay before countdown)
pt_br: Bronstein (atraso antes da contagem decrescente)
ru: Бронштейн (задержка перед обратным отсчетом)

source: Create Room
pt_br: Criar sala
ru: Создать комнату

source: Enter Room Code
pt_br: Introduzir código de sala
ru: Введите код комнаты

source: Ask your friend for their 6-character room code
pt_br: Peça ao seu amigo o código de sala de 6 caracteres
ru: Попросите у своего друга его 6-значный код комнаты

source: Join
pt_br: Juntar-se
ru: Присоединиться

source: You'll be matched with players of the same variant
pt_br: Será emparelhado com jogadores da mesma variante
ru: Вам будут подобраны игроки того же варианта

source: Find Opponent
pt_br: Encontrar oponente
ru: Найти противника

source: Waiting
pt_br: A aguardar
ru: Ожидание

source: Waiting for opponent...
pt_br: A aguardar oponente...
ru: В ожидании противника...

source: Share this code:
pt_br: Partilhe este código:
ru: Поделитесь этим кодом:

source: Copy room code
pt_br: Copiar código de sala
ru: Скопировать код комнаты

source: Game variant:
pt_br: Variante de jogo:
ru: Вариант игры:

source: Cancel
pt_br: Cancelar
ru: Отмена

source: Start
pt_br: Iniciar
ru: Старт

source: Game Configuration
pt_br: Configuração do Jogo
ru: Конфигурация игры

source: Choose which draughts rules to play with
pt_br: Escolha com quais regras de damas jogar
ru: Выберите, по каким правилам играть в шашки

source: Opposing Player
pt_br: Jogador Adversário
ru: Противник

source: Human
pt_br: Humano
ru: Человек

source: Play as
pt_br: Jogar como
ru: Играть как

source: Red
pt_br: Vermelho
ru: Красный

source: Black
pt_br: Preto
ru: Чёрный

source: Difficulty
pt_br: Dificuldade
ru: Сложность

source: Beginner
pt_br: Iniciante
ru: Начинающий

source: Intermediate
pt_br: Intermediário
ru: Средний

source: Advanced
pt_br: Avançado
ru: Продвинутый

source: Expert
pt_br: Especialista
ru: Эксперт

source: Grandmaster
pt_br: Grão-Mestre
ru: Гросмейстер

source: Time Limit
pt_br: Limite de Tempo
ru: Ограничение по времени

source: Use Time Limit
pt_br: Usar Limite de Tempo
ru: Использовать ограничение по времени

source: Minutes Per Side
pt_br: Minutos por Lado
ru: Минут на сторону

source: Fischer
ru: Фишер

source: Bronstein
ru: Бронштейн

source: Audio
pt_br: Áudio
ru: Звук

source: Play audio feedback during gameplay
pt_br: Reproduzir feedback de áudio durante o jogo
ru: Воспроизведение звуковой обратной связи во время игры

source: Application Theme
pt_br: Tema do Aplicativo
ru: Тема приложения

source: Choose the color scheme for the application
pt_br: Escolha o esquema de cores do aplicativo
ru: Выберите цветовую схему для приложения

source: Theme
pt_br: Tema
ru: Тема

source: Light, dark, or follow system preference
pt_br: Claro, escuro ou seguir preferência do sistema
ru: Светлая, тёмная или системная

source: Customize the appearance of the game board
pt_br: Personalize a aparência do tabuleiro de jogo
ru: Настроить внешний вид игровой доски
